se-research/CaroloCup/sources/STM32F4/embedded/ChibiOS/ChibiOS_2.6.0/os/hal/include/STM32F4GPIO_AF.h
/*
    STM32F4 Alternate Function Naming.
*/

/**
 * @file    STM32F4GPIO_AF.h
 * @brief   Naming for STM32F4 alternate functions.
 *
 * @addtogroup HAL
 * @{
 */

#ifndef _STM32F4GPIO_AF_H_
#define _STM32F4GPIO_AF_H_

#define STM32F4GPIO_AF_RTC_50Hz      ((uint8_t)0x00)  /* RTC_50Hz Alternate Function mapping */
#define STM32F4GPIO_AF_MCO           ((uint8_t)0x00)  /* MCO (MCO1 and MCO2) Alternate Function mapping */
#define STM32F4GPIO_AF_TAMPER        ((uint8_t)0x00)  /* TAMPER (TAMPER_1 and TAMPER_2) Alternate Function mapping */
#define STM32F4GPIO_AF_SWJ           ((uint8_t)0x00)  /* SWJ (SWD and JTAG) Alternate Function mapping */
#define STM32F4GPIO_AF_TRACE         ((uint8_t)0x00)  /* TRACE Alternate Function mapping */

#define STM32F4GPIO_AF_TIM1          ((uint8_t)0x01)  /* TIM1 Alternate Function mapping */
#define STM32F4GPIO_AF_TIM2          ((uint8_t)0x01)  /* TIM2 Alternate Function mapping */

#define STM32F4GPIO_AF_TIM3          ((uint8_t)0x02)  /* TIM3 Alternate Function mapping */
#define STM32F4GPIO_AF_TIM4          ((uint8_t)0x02)  /* TIM4 Alternate Function mapping */
#define STM32F4GPIO_AF_TIM5          ((uint8_t)0x02)  /* TIM5 Alternate Function mapping */

#define STM32F4GPIO_AF_TIM8          ((uint8_t)0x03)  /* TIM8 Alternate Function mapping */
#define STM32F4GPIO_AF_TIM9          ((uint8_t)0x03)  /* TIM9 Alternate Function mapping */
#define STM32F4GPIO_AF_TIM10         ((uint8_t)0x03)  /* TIM10 Alternate Function mapping */
#define STM32F4GPIO_AF_TIM11         ((uint8_t)0x03)  /* TIM11 Alternate Function mapping */

#define STM32F4GPIO_AF_I2C1          ((uint8_t)0x04)  /* I2C1 Alternate Function mapping */
#define STM32F4GPIO_AF_I2C2          ((uint8_t)0x04)  /* I2C2 Alternate Function mapping */
#define STM32F4GPIO_AF_I2C3          ((uint8_t)0x04)  /* I2C3 Alternate Function mapping */

#define STM32F4GPIO_AF_SPI1          ((uint8_t)0x05)  /* SPI1 Alternate Function mapping */
#define STM32F4GPIO_AF_SPI2          ((uint8_t)0x05)  /* SPI2/I2S2 Alternate Function mapping */

#define STM32F4GPIO_AF_SPI3          ((uint8_t)0x06)  /* SPI3/I2S3 Alternate Function mapping */

#define STM32F4GPIO_AF_USART1        ((uint8_t)0x07)  /* USART1 Alternate Function mapping */
#define STM32F4GPIO_AF_USART2        ((uint8_t)0x07)  /* USART2 Alternate Function mapping */
#define STM32F4GPIO_AF_USART3        ((uint8_t)0x07)  /* USART3 Alternate Function mapping */
#define STM32F4GPIO_AF_I2S3ext       ((uint8_t)0x07)  /* I2S3ext Alternate Function mapping */

#define STM32F4GPIO_AF_UART4         ((uint8_t)0x08)  /* UART4 Alternate Function mapping */
#define STM32F4GPIO_AF_UART5         ((uint8_t)0x08)  /* UART5 Alternate Function mapping */
#define STM32F4GPIO_AF_USART6        ((uint8_t)0x08)  /* USART6 Alternate Function mapping */

#define STM32F4GPIO_AF_CAN1          ((uint8_t)0x09)  /* CAN1 Alternate Function mapping */
#define STM32F4GPIO_AF_CAN2          ((uint8_t)0x09)  /* CAN2 Alternate Function mapping */
#define STM32F4GPIO_AF_TIM12         ((uint8_t)0x09)  /* TIM12 Alternate Function mapping */
#define STM32F4GPIO_AF_TIM13         ((uint8_t)0x09)  /* TIM13 Alternate Function mapping */
#define STM32F4GPIO_AF_TIM14         ((uint8_t)0x09)  /* TIM14 Alternate Function mapping */

#define STM32F4GPIO_AF_OTG_FS        ((uint8_t)0xA)   /* OTG_FS Alternate Function mapping */
#define STM32F4GPIO_AF_OTG_HS        ((uint8_t)0xA)   /* OTG_HS Alternate Function mapping */

#define STM32F4GPIO_AF_ETH           ((uint8_t)0x0B)  /* ETHERNET Alternate Function mapping */

#define STM32F4GPIO_AF_FSMC          ((uint8_t)0xC)   /* FSMC Alternate Function mapping */
#define STM32F4GPIO_AF_OTG_HS_FS     ((uint8_t)0xC)   /* OTG HS configured in FS, Alternate Function mapping */
#define STM32F4GPIO_AF_SDIO          ((uint8_t)0xC)   /* SDIO Alternate Function mapping */

#define STM32F4GPIO_AF_DCMI          ((uint8_t)0x0D)  /* DCMI Alternate Function mapping */

#define STM32F4GPIO_AF_EVENTOUT      ((uint8_t)0x0F)  /* EVENTOUT Alternate Function mapping */

#endif /* _STM32F4GPIO_AF_H_ */

/** @} */
